{
  "products": [
    {
      "name": "PCs Corbel",
      "category": "beam connections",
      "summary": """PCs® Corbel is a building product used as a vertical support between steel beams, composite steel-concrete beams
        like Peikko’s DELTABEAM®, or reinforced concrete beams and reinforced concrete columns or walls. It consists of
        a steel corbel bolted to a fastening plate integrated into the column. The fastening plate is cast into the column
        together with the main reinforcement and the corbel plate is attached to the column only after the formwork is
        removed. The shape and material of the formwork may hide the corbel entirely.
        PCs® is dimensioned so that the positioning of the corbel plate relative to the column plate may be rectifi ed. After
        the corbel plate is bolted onto the column plate, PCs® is ready for use without any additional actions in the factory or
        on-site (such as wedging and welding). The standard models of PCs® are designed to withstand vertical loads up to
        1500 kN. These resistances are guaranteed when PCs® supports steel, composite and concrete beams. In addition
        to vertical resistance, torsion resistance is also guaranteed for PCs® supporting steel and composite beams."""
    },
    {
      "name": "Wall Shoe Anchor Bolts",
      "category": "wall connections",
      "summary": """Wall shoe anchor bolts with special AL washers are used together with SUMO® Wall Shoes. They are based on approved HPM® and PPM® Anchor Bolts. The product range is suitable for moderate and heavy loading conditions.
        Wall Shoe Anchor Bolts transfer tension, compression and shear forces to the reinforced concrete base structure (e.g. foundations). The bolts are based on standard HPM® and PPM® Anchor Bolt types and they are delivered with specially designed AL wall shoe washers. 
        There are two anchor types: long anchors (type P), which are used for splices, and short anchors (type L) with headed studs, which are used for anchoring into foundations.
        The long anchor bolts transfer compression and tension forces through the rib bond of ribbed bars, while the short anchor bolts transfer the forces through the combination of headed studs and rib bond."""
    },
    {
      "name": "SUMO® Wall Shoe",
      "category": "wall connections",
      "summary": """SUMO® Wall Shoes are utilized to create cost-effective tensile connections between precast concrete walls and foundations, as well as between precast concrete walls themselves. SUMO® Wall Shoes are used together with HPM® and PPM® Anchor Bolt types incorporating specially designed AL washers.
        Specifically engineered for tension splices of precast wall elements, SUMO® Wall Shoes find applications in various structural components of buildings, including core walls and elevator shafts, to enhance stiffness. The transfer of loads from the walls to foundations or other load-bearing structures is achieved through the combined utilization of wall shoes, anchor bolts, and wall reinforcements. SUMO® Wall Shoes are available in a range of standard models to accommodate diverse precast concrete wall connections.
        The system comprises wall shoes and anchor bolts. The wall shoes are embedded within the precast concrete walls, while the anchor bolts are cast into foundations or other walls. During on-site assembly, the walls are erected on shim plates that have been adjusted to the proper position, and then secured to the anchor bolts using nuts and special AL washers as part of the bolt connection. The finalization of precast concrete wall connections involves grouting the recesses and joints beneath the wall."""
    },
    {
      "name": "PVL® Connecting Loop",
      "category": "wall connections",
      "summary": """PVL® Connecting Loops are single-wire loops used for connecting precast wall panels to one another or to a column. PVL® Connecting Loops simplify the wall installation process, as they only require the removal of a protecting tape and bending of the loop out from the box.
        Prior to the casting of the elements, wire loop boxes are installed onto the formwork at the necessary spacing to bear shear loads. Once the formwork is removed, the protective tape covering the loops can be taken off, and the loops can be bent open using a hammer or a pin. The wall panels are then installed and supported as per the construction plans. A vertical rebar is inserted through the loops, ensuring structural integrity. The horizontal position of the loops is checked to ensure proper alignment. Finally, after the completion of the formwork, concrete grout is poured or pumped into the joint to complete the installation.
        PVL® Connecting Loops are available in standard wire lengths of 60 mm, 80 mm, 100 mm, 120 mm, and 140 mm, suitable to joint depths ranging from 80 mm to 140 mm."""
    },
    {
      "name": "PSB® Punching Reinforcement",
      "category": "Punching Reinforcement Systems",
      "summary": """PSB® Punching Reinforcement is an ETA-approved system providing the highest resistance on the market. PSB® Punching and Shear Rails offer simple and reliable solutions against punching shear failure and shear failure of slabs, foundations, walls and beams by increasing their resistance.
        PSB® Punching Reinforcement is applicable to various kinds of structural systems and installation situations. PSB® rails consist of double-headed studs, welded to a non-structural flat bar. The system is available as 2- or 3- stud elements, which can be used to construct the required reinforcement, or as complete elements where all studs are welded to one assembly profile. Elements are manufactured individually according to the static requirements. Being fully integrated in the concrete elements, it is an ideal reinforcement system for monolithic slim structures or flat concrete structures in general, which can be used as punching reinforcement (PSB®) or shear reinforcement (PSB®-S)."""
    },
    {
      "name": "PSB® Headed Anchors",
      "category": "Punching Reinforcement Systems",
      "summary": """Peikko's PSB® Headed Anchor provides a reliable reinforcement solution for steel reinforced concrete. It offers an easy and time-saving method, particularly beneficial in highly congested areas.
        PSB® Headed Anchor is a simple, easily installed, efficient and effective way of anchoring reinforcement in concrete structures. It is an ETA assessed and CE marked solution.
        The versatility of the PSB® Headed Anchor allows for its application in various scenarios where rebar anchorage is required, whether it be for enhancing joint detailing or for convenient installation at construction sites. It can be used across a wide range of concrete elements, including foundation and floor slabs, columns, footings, walls, beams, frame corners, and corbels.
        Thanks to its effectiveness, the PSB® Headed Anchor contributes to reducing rebar congestion in heavily reinforced areas of cast-in-situ concrete construction. This aids in streamlining construction processes and achieving optimal structural integrity."""
    },
    {
      "name": "PC® Beam Shoe",
      "category": "beam connections",
      "summary": """PC® Beam Shoes are used for easy installation of both reinforced and pre-stressed precast concrete beams to columns. PC® Beam Shoes are used as the counterpart for PCs® Corbels. 
        PC® Beam Shoes are cast to the beam where all parts of the beam shoe are hidden. It consists of steel plates that form a pocket for corbel and reinforcing bars to anchor forces into the beam. PC® Beam Shoes are dimensioned to be used with PCs® Corbel so that the ﬁnal position of the beam installed on the corbel can be freely adjusted. After the corbel plate of PCs® Corbel is bolted onto the column, a beam with PC® Beam Shoe can be installed on the corbel without any wedging or welding.
        The standard models of PC® Beam Shoes are designed to withstand vertical and horizontal loads with a maximum design value for vertical loads of up to 1,500 kN. There are two different models: L (Low) for beam flange heights < 60 mm and H (High) for beam flange heights > 60 mm."""
    },
    {
      "name": "BECO® Beam Shoe",
      "category": "beam connections",
      "summary": """BECO® Beam Shoes offer efficient and moment-resisting bolted connections between precast concrete columns and precast concrete beams. These beam shoes are used in conjunction with COPRA® Anchoring Couplers. The wide range of products is suitable for a variety of loading conditions, ranging from light to heavy.
        BECO® Beam Shoes are embedded into precast concrete beams, while COPRA® Anchoring Couplers are embedded into columns. On the construction site, the beams are positioned on corbels, adjusted to the correct locations, and securely fastened to the anchoring couplers using threaded bars. The joint between the beam and column is then filled with grout before loading the connection. Once the grout has hardened, the joint functions as a reinforced concrete structure."""
    },
    {
      "name": "PIFOREX® Balcony Parapet Connector",
      "category": "slabs",
      "summary": """Stainless steel made PIFOREX® Balcony Parapet Connectors are used to connect concrete balcony parapets to concrete balcony slabs.
        The PIFOREX® Balcony Parapet Connector is anchored to the balcony parapet by headed fasteners as the loads to the balcony slab are anchored by reinforcing steel bars.
        The balcony parapet is lowered and positioned according to plans so that the Railing Parts go inside the Connecting items previously assembled to the edge of the balcony slab.
        PIFOREX® Balcony Parapet Connectors are designed to withstand vertical, lateral and torsional loading to the balcony slab, ensuring an effective and long-lasting connection between the balcony parapet and the slab."""
    },
    {
      "name": "SLADEX® Balcony Slab Connector",
      "category": "slabs",
      "summary": """
        SLADEX® Balcony Slab Connector is used to create an efficient connection between the precast balcony slab and the load bearing structure without compromising the thermal insulation on the sandwich wall panels or the building envelope.

        SLADEX® Balcony Slab Connector offers reliable load distribution with easy installation. It consists of a stainless steel RHS tube and rails with double headed studs and it is cast in the balcony slab at the precast factory. Protrusion of 200 mm to 500 mm allows installation and support of the balcony slab on the load-bearing structure through the sandwich panels.

        SLADEX® Balcony Slab Connector transfers vertical force from precast balcony slabs during the erection and final stages. Once cast in the load-bearing concrete structure, it also transfers tensile forces.

        SLADEX® Balcony Slab Connector is available in several standardized models with precalculated resistances. 
      """
    },
    {
      "name": "TERAJOINT® Free Movement Joint",
      "category": "",
      "summary": """
        TERAJOINT® is a prefabricated leave-in-place joint system designed to build formed free-movement joints, consisting of heavy-duty arris armoring, permanent formwork and a load transfer system. It is suitable for all large-area construction methods for ground-bearing and pile-supported concrete floors.

        TERAJOINT® is the industry standard in the range of prefabricated heavy-duty movement joint systems for high flatness category industrial floors. TERAJOINT® transfers vertical loads between adjacent slabs and minimizes the vertical displacement of the slabs. The load transfer system is accomplished by utilizing high-strength steel discrete plate dowels, moving within rigid plastic release sleeves. The cold drawn steel rails provide extremely durable protection to the slab arrises, making it ideal for floors in a heavy-duty traffic environment.

        The system ensures reliable load transfer in formed free-movement joints with openings up to 15 mm wide, and it is suitable for slab depths from 100 mm to 300 mm. TERAJOINT® can be supplied with different types of plate dowel systems. TERAJOINT® is available in plain steel, hot-dip galvanized finish or stainless steel, which means that the system offers a solution for all operational environments.
              """
    },
    {
      "name": "COPRA® Anchoring Coupler",
      "category": "-",
      "summary": """
        The COPRA® Anchoring Coupler is a versatile anchoring system designed for various bolted connections. It is primarily used in conjunction with HPKM® Column Shoes, BOLDA® Column Shoes, or BECO® Beam Shoes. This product range offers excellent suitability for both moderate and heavy-duty loading conditions.

        The COPRA® Anchoring Coupler serves as a rebar anchor featuring female threads, enabling bolted connections in precast concrete structures. By effectively transferring tensile, compression, and shear forces, COPRA® Anchoring Couplers ensure robust connections during both erection and the final stage. COPRA® can be adapted to suit diverse types of concrete structures.

        The utilization of COPRA® Anchoring Couplers with removable threaded bars mitigates the risk of protruding components being damaged during the construction process. This design element also enhances safety on work sites.
        """
    },
    {
      "name": "WELDA® Anchor Plate",
      "category": "-",
      "summary": """
        WELDA® Anchor Plates are CE marked all-rounders in transferring loads to concrete from other structures via welded connection. The stud-headed anchors welded onto the plate are optimized for easy installation into the reinforcement. Anchors are available in three different lengths to avoid collision with reinforcement or need of supplementary reinforcement.

        WELDA® Anchor Plates are designed to fit to thin and shallow structures such as wall panels or slabs, but they can also be placed in other structures such as beams and columns.

        Standard WELDA® Anchor Plates come in various sizes, from 50 mm x 100 mm up to 300 mm x 300 mm, covering all standard fastening needs. Plate thickness varies from 8 mm to 15 mm, making the effective product depth range from 68 mm to 165 mm. Plates and studs are available in various material combinations.

        To fulfil customer specific needs, dimensions and shapes of WELDA® Anchor Plates can be modified. On request, the plate can also be machined, e.g. drilling of nail holes, and other components, e.g. shear dowels, can be welded to the plate. Contact us for an offer for modified WELDA® Anchor Plates.

        Long WELDA® Anchor Plates can be used for welding of larger or multiple profiles to one long plate. Long WELDA® Anchor Plates’ product page.

        All WELDA® Anchor Plates are CE marked based on ETA-16/0430 and fulfil all the essential demands set for anchor plates. ETA is the only way to specify product performance and proper behaviour in construction throughout the product lifecycle. Peikko is the only company in the industry that can deliver CE marked anchor plates based on ETA.
        """
    },
    {
      "name": "THRELDA® Anchor Plate",
      "category": "",
      "summary": """
        THRELDA® Anchor Plates provide a convenient and efficient solution for transferring loads between concrete and steel structures, offering a robust base for a bolted connection on a concrete element.

        THRELDA® Anchor Plates comprise steel plates, headed steel anchor bars (studs) which are ribbed and threaded, and threaded couplers. These create a one-sided or double-sided bolted connection between reinforced concrete structures such as walls and columns, and steel members such as beams or bracings.

        The bolted connection effectively transfers axial and shear forces from the connecting steel member and anchor them into the concrete. In the case of THRELDA® Double models, the forces are transmitted through the anchor bars to the opposite sides of the concrete element.

        THRELDA® Anchor Plates are easily installed into formwork using standard accessories. The connection can bear load as soon as the concrete has the required strength, and the bolts are tightened.

        Standard sizes are available to suit most applications, and the plates are available in many sizes. The anchor bars are available in several standard lengths, and they can also be customized according to specific client requirements.

        In the event of disassembly or dismantling, THRELDA® Anchor Plate bolted connections facilitate the easy removal and recycling of building materials, contributing to sustainability efforts.
      """
    },
    {
      "name": "COPRA® Anchoring Coupler",
      "category": "",
      "summary": """
      The COPRA® Anchoring Coupler is a versatile anchoring system designed for various bolted connections. It is primarily used in conjunction with HPKM® Column Shoes, BOLDA® Column Shoes, or BECO® Beam Shoes. This product range offers excellent suitability for both moderate and heavy-duty loading conditions.

      The COPRA® Anchoring Coupler serves as a rebar anchor featuring female threads, enabling bolted connections in precast concrete structures. By effectively transferring tensile, compression, and shear forces, COPRA® Anchoring Couplers ensure robust connections during both erection and the final stage. COPRA® can be adapted to suit diverse types of concrete structures.

      The utilization of COPRA® Anchoring Couplers with removable threaded bars mitigates the risk of protruding components being damaged during the construction process. This design element also enhances safety on work sites.
      """
    },
    {
      "name": "SLADEX® Balcony Slab Connector",
      "category": "slabs",
      "summary": """
        SLADEX® Balcony Slab Connector is used to create an efficient connection between the precast balcony slab and the load-bearing structure without compromising the thermal insulation on the sandwich wall panels or the building envelope.

        SLADEX® Balcony Slab Connector offers reliable load distribution with easy installation. It consists of a stainless steel RHS tube and rails with double-headed studs and is cast into the balcony slab at the precast factory. Protrusion of 200 mm to 500 mm allows installation and support of the balcony slab on the load-bearing structure through the sandwich panels.

        SLADEX® Balcony Slab Connector transfers vertical force from precast balcony slabs during the erection and final stages. Once cast in the load-bearing concrete structure, it also transfers tensile forces.

        SLADEX® Balcony Slab Connector is available in several standardized models with pre-calculated resistances.
      """
    },
    {
      "name": "TERAJOINT® Free Movement Joint",
      "category": "joints",
      "summary": """
        TERAJOINT® is a prefabricated leave-in-place joint system designed to create formed free-movement joints, consisting of heavy-duty arris armoring, permanent formwork, and a load transfer system. It is suitable for large-area construction methods for ground-bearing and pile-supported concrete floors.
        TERAJOINT® is the industry standard in prefabricated heavy-duty movement joint systems for high flatness category industrial floors. It transfers vertical loads between adjacent slabs and minimizes the vertical displacement of slabs. The load transfer system uses high-strength steel discrete plate dowels that move within rigid plastic release sleeves. Cold-drawn steel rails provide durable protection to slab arrises, making it ideal for floors with heavy-duty traffic.
        The system ensures reliable load transfer in formed free-movement joints with openings up to 15 mm wide and is suitable for slab depths from 100 mm to 300 mm. TERAJOINT® is available with different types of plate dowel systems in plain steel, hot-dip galvanized, or stainless steel finishes, offering a solution for all operational environments.
      """
    },
    {
      "name": "COPRA® Anchoring Coupler",
      "category": "anchors",
      "summary": """
        The COPRA® Anchoring Coupler is a versatile anchoring system designed for various bolted connections. It is primarily used with HPKM® Column Shoes, BOLDA® Column Shoes, or BECO® Beam Shoes, offering excellent suitability for both moderate and heavy-duty loading conditions.

        The COPRA® Anchoring Coupler serves as a rebar anchor featuring female threads, enabling bolted connections in precast concrete structures. By effectively transferring tensile, compression, and shear forces, COPRA® Anchoring Couplers ensure robust connections during both erection and final stages. COPRA® can be adapted to suit diverse types of concrete structures.

        The use of COPRA® Anchoring Couplers with removable threaded bars mitigates the risk of protruding components being damaged during construction, enhancing safety on worksites.
      """
    },
    {
      "name": "WELDA® Anchor Plate",
      "category": "plates",
      "summary": """
        WELDA® Anchor Plates are CE marked all-rounders in transferring loads to concrete from other structures via welded connections. The stud-headed anchors welded onto the plate are optimized for easy installation into the reinforcement. Anchors are available in three different lengths to avoid collisions with reinforcement or the need for supplementary reinforcement.

        WELDA® Anchor Plates are designed for thin and shallow structures such as wall panels or slabs, but they can also be used in beams and columns.

        Standard WELDA® Anchor Plates come in various sizes, from 50 mm x 100 mm to 300 mm x 300 mm, covering all standard fastening needs. Plate thickness varies from 8 mm to 15 mm, making the effective product depth range from 68 mm to 165 mm. Plates and studs are available in various material combinations.

        To fulfill specific customer needs, dimensions and shapes of WELDA® Anchor Plates can be customized. On request, the plates can be machined, e.g., with drilled nail holes, and other components, such as shear dowels, can be welded to the plate. Contact us for a custom offer.

        Long WELDA® Anchor Plates can be used for welding larger or multiple profiles to a single long plate. All WELDA® Anchor Plates are CE marked based on ETA-16/0430, ensuring compliance with all essential construction demands. Peikko is the only company in the industry that can deliver CE marked anchor plates based on ETA.
      """
    },
    {
      "name": "THRELDA® Anchor Plate",
      "category": "plates",
      "summary": """
        THRELDA® Anchor Plates provide an efficient solution for transferring loads between concrete and steel structures, offering a strong base for bolted connections in concrete elements.

        THRELDA® Anchor Plates consist of steel plates, headed steel anchor bars (studs) which are ribbed and threaded, and threaded couplers. These components create one-sided or double-sided bolted connections between reinforced concrete structures, such as walls and columns, and steel members like beams or bracings.

        The bolted connection effectively transfers axial and shear forces from the connecting steel member to the concrete. In the case of THRELDA® Double models, the forces are transmitted through anchor bars to the opposite sides of the concrete element.

        THRELDA® Anchor Plates are easily installed into formwork using standard accessories. The connection can bear load once the concrete reaches the required strength and the bolts are tightened.

        Standard sizes are available for most applications, and the plates are available in many sizes. The anchor bars are available in several standard lengths and can be customized to client specifications.

        THRELDA® Anchor Plates facilitate the easy removal and recycling of building materials in the event of disassembly or dismantling, contributing to sustainability.
      """
    },
    {
      "name": "COPRA® Anchoring Coupler",
      "category": "anchors",
      "summary": """
        The COPRA® Anchoring Coupler is a versatile anchoring system designed for various bolted connections. It is primarily used with HPKM® Column Shoes, BOLDA® Column Shoes, or BECO® Beam Shoes, making it suitable for both moderate and heavy-duty loading conditions.

        The COPRA® Anchoring Coupler serves as a rebar anchor featuring female threads, enabling bolted connections in precast concrete structures. It effectively transfers tensile, compression, and shear forces, ensuring robust connections during both erection and final stages. COPRA® can be adapted to suit diverse concrete structures.

        The use of removable threaded bars with COPRA® Anchoring Couplers helps prevent damage to protruding components during construction, improving safety on worksites.
      """
    }
  ]
}
